src/src/AccumulationRegisters/VATIncurred.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>VATIncurred</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountExcludesVAT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShipmentDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.RegistersCorrection</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/InformationRegisters/AccountingPolicy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>AccountingPolicy</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RegisteredForVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostVATEntriesBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostAdvancePaymentsBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteUseTaxInvoices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueAutomaticallyAgainstSales</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CashMethodOfAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InventoryValuationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnFromCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnToSupplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Documents/TaxInvoiceReceived.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>TaxInvoiceReceived</Name>
			<BasedOn>
				<xr:Item>Document.SupplierInvoice</xr:Item>
				<xr:Item>Document.DebitNote</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.VATIncurred</xr:Item>
				<xr:Item>AccountingRegister.AccountingJournalEntries</xr:Item>
				<xr:Item>AccumulationRegister.VATInput</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateOfSupply</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypesTaxInvoiceReceived</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>BasisDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BasisDocument</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
								<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/AccumulationRegisters/VATIncurred/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	VATIncurred.LineNumber AS LineNumber,
	|	VATIncurred.Company AS Company,
	|	VATIncurred.Supplier AS Supplier,
	|	VATIncurred.ShipmentDocument AS ShipmentDocument,
	|	VATIncurred.VATRate AS VATRate,
	|	VATIncurred.AmountExcludesVAT AS AmountExcludesVATBeforeWrite,
	|	VATIncurred.AmountExcludesVAT AS AmountExcludesVATChange,
	|	VATIncurred.AmountExcludesVAT AS AmountExcludesVATOnWrite,
	|	VATIncurred.VATAmount AS VATAmountBeforeWrite,
	|	VATIncurred.VATAmount AS VATAmountChange,
	|	VATIncurred.VATAmount AS VATAmountOnWrite
	|INTO RegisterRecordsVATIncurredChange
	|FROM
	|	AccumulationRegister.VATIncurred AS VATIncurred");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsVATIncurredChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT
	|	RegisterRecordsVATIncurredChange.LineNumber AS LineNumber,
	|	RegisterRecordsVATIncurredChange.Company AS Company,
	|	RegisterRecordsVATIncurredChange.Supplier AS Supplier,
	|	RegisterRecordsVATIncurredChange.ShipmentDocument AS ShipmentDocument,
	|	RegisterRecordsVATIncurredChange.VATRate AS VATRate,
	|	RegisterRecordsVATIncurredChange.AmountExcludesVATOnWrite AS AmountExcludesVAT,
	|	ISNULL(VATIncurredBalances.AmountExcludesVATBalance, 0) AS AmountExcludesVATBalance,
	|	RegisterRecordsVATIncurredChange.VATAmountOnWrite AS VATAmount,
	|	ISNULL(VATIncurredBalances.VATAmountBalance, 0) AS VATAmountBalance
	|INTO TT_RegisterRecordsVATIncurredChange
	|FROM
	|	RegisterRecordsVATIncurredChange AS RegisterRecordsVATIncurredChange
	|		LEFT JOIN AccumulationRegister.VATIncurred.Balance(&ControlTime, ) AS VATIncurredBalances
	|		ON RegisterRecordsVATIncurredChange.Company = VATIncurredBalances.Company
	|			AND RegisterRecordsVATIncurredChange.Supplier = VATIncurredBalances.Supplier
	|			AND RegisterRecordsVATIncurredChange.ShipmentDocument = VATIncurredBalances.ShipmentDocument
	|			AND RegisterRecordsVATIncurredChange.VATRate = VATIncurredBalances.VATRate
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	RegisterRecordsVATIncurredChange.LineNumber AS LineNumber,
	|	RegisterRecordsVATIncurredChange.Company AS Company,
	|	RegisterRecordsVATIncurredChange.Supplier AS Supplier,
	|	RegisterRecordsVATIncurredChange.ShipmentDocument AS ShipmentDocument,
	|	RegisterRecordsVATIncurredChange.VATRate AS VATRate,
	|	RegisterRecordsVATIncurredChange.AmountExcludesVAT AS AmountExcludesVAT,
	|	RegisterRecordsVATIncurredChange.AmountExcludesVATBalance AS AmountExcludesVATBalance,
	|	RegisterRecordsVATIncurredChange.VATAmount AS VATAmount,
	|	RegisterRecordsVATIncurredChange.VATAmountBalance AS VATAmountBalance
	|FROM
	|	TT_RegisterRecordsVATIncurredChange AS RegisterRecordsVATIncurredChange
	|WHERE
	|	NOT RegisterRecordsVATIncurredChange.ShipmentDocument REFS Document.DebitNote
	|	AND (RegisterRecordsVATIncurredChange.AmountExcludesVATBalance < 0
	|			OR RegisterRecordsVATIncurredChange.VATAmountBalance < 0)
	|
	|UNION ALL
	|
	|SELECT
	|	RegisterRecordsVATIncurredChange.LineNumber,
	|	RegisterRecordsVATIncurredChange.Company,
	|	RegisterRecordsVATIncurredChange.Supplier,
	|	RegisterRecordsVATIncurredChange.ShipmentDocument,
	|	RegisterRecordsVATIncurredChange.VATRate,
	|	RegisterRecordsVATIncurredChange.AmountExcludesVAT,
	|	-RegisterRecordsVATIncurredChange.AmountExcludesVATBalance,
	|	RegisterRecordsVATIncurredChange.VATAmount,
	|	-RegisterRecordsVATIncurredChange.VATAmountBalance
	|FROM
	|	TT_RegisterRecordsVATIncurredChange AS RegisterRecordsVATIncurredChange
	|WHERE
	|	RegisterRecordsVATIncurredChange.ShipmentDocument REFS Document.DebitNote
	|	AND (RegisterRecordsVATIncurredChange.AmountExcludesVATBalance > 0
	|			OR RegisterRecordsVATIncurredChange.VATAmountBalance > 0)
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#EndRegion

#Region InfobaseUpdate

Procedure ProcessDataToUpgradeToNewVersion() Export
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DebitNote.Ref AS Ref,
	|	AccountingPolicy.PostVATEntriesBySourceDocuments AS PostVATEntriesBySourceDocuments,
	|	AccountingPolicy.Period AS Period
	|INTO TT_DebitNotesAllAP
	|FROM
	|	Document.DebitNote AS DebitNote
	|		INNER JOIN InformationRegister.AccountingPolicy AS AccountingPolicy
	|		ON DebitNote.Company = AccountingPolicy.Company
	|			AND DebitNote.Date >= AccountingPolicy.Period
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_DebitNotesAllAP.Ref AS Ref,
	|	MAX(TT_DebitNotesAllAP.Period) AS Period
	|INTO TT_DebitNotesLatestAP
	|FROM
	|	TT_DebitNotesAllAP AS TT_DebitNotesAllAP
	|
	|GROUP BY
	|	TT_DebitNotesAllAP.Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_DebitNotesLatestAP.Ref AS Ref
	|FROM
	|	TT_DebitNotesLatestAP AS TT_DebitNotesLatestAP
	|		INNER JOIN TT_DebitNotesAllAP AS TT_DebitNotesAllAP
	|		ON TT_DebitNotesLatestAP.Ref = TT_DebitNotesAllAP.Ref
	|			AND TT_DebitNotesLatestAP.Period = TT_DebitNotesAllAP.Period
	|		LEFT JOIN AccumulationRegister.VATIncurred AS VATIncurred
	|		ON TT_DebitNotesLatestAP.Ref = VATIncurred.Recorder
	|			AND (VATIncurred.LineNumber = 1)
	|WHERE
	|	NOT TT_DebitNotesAllAP.PostVATEntriesBySourceDocuments
	|	AND VATIncurred.Recorder IS NULL
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	TaxInvoiceReceived.Ref
	|FROM
	|	Document.TaxInvoiceReceived AS TaxInvoiceReceived
	|		INNER JOIN Document.TaxInvoiceReceived.BasisDocuments AS TaxInvoiceReceivedBasisDocuments
	|		ON TaxInvoiceReceived.Ref = TaxInvoiceReceivedBasisDocuments.Ref
	|			AND (TaxInvoiceReceivedBasisDocuments.BasisDocument REFS Document.DebitNote)
	|		LEFT JOIN AccumulationRegister.VATIncurred AS VATIncurred
	|		ON TaxInvoiceReceived.Ref = VATIncurred.Recorder
	|			AND (VATIncurred.ShipmentDocument REFS Document.DebitNote)
	|WHERE
	|	TaxInvoiceReceived.Posted
	|	AND VATIncurred.Recorder IS NULL";
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		
		BeginTransaction();
		
		DocObject = Selection.Ref.GetObject();
		
		DriveServer.InitializeAdditionalPropertiesForPosting(DocObject.Ref, DocObject.AdditionalProperties);
		
		Documents[DocObject.Metadata().Name].InitializeDocumentData(DocObject.Ref, DocObject.AdditionalProperties);
		
		If DocObject.AdditionalProperties.TableForRegisterRecords.Property("TableVATIncurred")
			And DocObject.AdditionalProperties.TableForRegisterRecords.TableVATIncurred.Count() Then
			
			DriveServer.ReflectVATIncurred(DocObject.AdditionalProperties, DocObject.RegisterRecords, False);
			
		Else
			
			DocObject.RegisterRecords.VATIncurred.Clear();
			DocObject.RegisterRecords.VATIncurred.Write = True;
			
		EndIf;
		
		DriveServer.WriteRecordSets(DocObject.ThisObject);
		
		DocObject.AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
		
		CommitTransaction();
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
